from collections import Counter


from re import findall

text = """Імператор-філософ — така характеристика віддавна усталилася 
в європейській культурній традиції за 
римлянином Марком Аврелієм Антоніном. А втім, кожна історична 
доба, кожне покоління, кожна суспільна течія, кожен мислитель, 
які так чи так покликалися на Марка Аврелія, вкладали в 
цю характеристику своє розуміння — і ці розмаїті погляди на 
античну постать через призму щоразу іншої ідеологічної програми
 ледве чи могли дати змогу пильніше до неї приглянутися. """

words = findall(r"\w+", text)

counter = Counter(words)

print(f"""-кількість символів у тексті з пробілами: {len(text)}
     -кількість символів у тексті без пробілів: {len(text.replace(" ", ""))}
     -кількість слів у тексті: {len(words)}
     -кількість різних слів (без повторів): {len(counter)}
     -кількість унікальних слів, що зустрічаються лише один раз: {sum(count == 1 for count in counter.values())}""")
